# THIS FILE IS AUTOMATICALLY GENERATED
# Project: F:\BW Data\01 - Project\11 - MH-8W\01 - SW\01 - Release\MH-8W_Proximity_Board\MH-8W_Proximity_Board_V11_20170718\MH-8W_PROXIMITY.cydsn\Bootloader_V01\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Wed, 19 Jul 2017 08:25:05 GMT
#set_units -time ns
create_clock -name {I2C_Slave_SCBCLK(FFB)} -period 625 -waveform {0 312.5} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 125 -waveform {0 31.25} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {I2C_Slave_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 11 21} [list]


# Component constraints for F:\BW Data\01 - Project\11 - MH-8W\01 - SW\01 - Release\MH-8W_Proximity_Board\MH-8W_Proximity_Board_V11_20170718\MH-8W_PROXIMITY.cydsn\Bootloader_V01\Bootloader_PSoC4_Example01.cydsn\TopDesign\TopDesign.cysch
# Project: F:\BW Data\01 - Project\11 - MH-8W\01 - SW\01 - Release\MH-8W_Proximity_Board\MH-8W_Proximity_Board_V11_20170718\MH-8W_PROXIMITY.cydsn\Bootloader_V01\Bootloader_PSoC4_Example01.cydsn\Bootloader_PSoC4_Example01.cyprj
# Date: Wed, 19 Jul 2017 08:25:04 GMT
